puts "---------------no.1--------------------"

# 文字列を書いてみよう

# 数値を書いてみよう


puts "---------------nred.2--------------------"

# 変数を書いていこう

#定数を書いていこう


 puts "---------------no.3--------------------"

# 四則演算を使ってみよう


 puts "---------------no.4--------------------"

# 配列を書いていこう


puts "---------------no.5--------------------"

# ハッシュを書いていこう


puts "---------------no.6--------------------"

# ifで条件分岐をしよう 


puts "---------------no.7--------------------"

# # caseで条件分岐をしよう


puts "---------------no.8--------------------"

# # whileで繰り返しの処理をしよう


puts "---------------no.9--------------------"

# for・eachで繰り返しの処理をしよう


puts "---------------no.10--------------------"

# メソッドを作ってみよう


puts "---------------no.11--------------------"

# クラスを作ってみよう

